import React from 'react'

const TermsModal = ({ showModalHandler }) => {
  return (
    <div className="modal modalType01 open">
      <div className="modalArea width1200">
        <div className="contents">
          <div className="termsWrap">
            <h2>개인정보 수집 및 이용동의</h2>
            <div className="termsContent">
              <p>
                안녕 바나나 비나리 이플 컴퓨터 책방 아련 그루잠 아슬라 가온해 소솜 여우별 아련 아리아 사과 사과 미리내 미리내 함초롱하다 도르레 도르레 소솜 포도
                도서관 도담도담 미리내 도담도담 나래 컴퓨터 책방 그루잠 나래 도서 감사합니다 도서관 도서관 컴퓨터 우리는 별빛 도서관 도담도담 사과 아름드리 도서
                달볓 책방 산들림 바나나 미쁘다 책방. 아름드리 소솜 옅구름 소솜 바람꽃 도르레 아름드리 곰다시 소록소록 별하 예그리나 별빛 별빛 소솜 아련 아름드리
                여우별 사과 늘품 감사합니다 가온누리 아련 나비잠 사과 안녕 가온누리 바나나 노트북 비나리 컴퓨터 컴퓨터 감사합니다 소록소록 여우별 도서 아련
                아리아 로운 도서 나래 책방 이플 도르레 미쁘다 아름드리 컴퓨터 비나리 아슬라 아리아 바람꽃. 별빛 우리는 도서관 늘품 도서 나래 그루잠 곰다시 소솜
                달볓 안녕 가온누리 늘품 미리내 별빛 곰다시 아름드리 도서 그루잠 아리아 컴퓨터 늘품 책방 도르레 우리는 가온해 로운 가온해 비나리 노트북
                감사합니다 노트북 별하 노트북 늘품 달볓 별빛 컴퓨터 책방 로운 바나나 아슬라 가온누리 여우비 가온해 가온해 예그리나 여우비 가온누리 미쁘다.안녕
                바나나 비나리 이플 컴퓨터 책방 아련 그루잠 아슬라 가온해 소솜 여우별 아련 아리아 사과 사과 미리내 미리내 함초롱하다 도르레 도르레 소솜 포도
                도서관 도담도담 미리내 도담도담 나래 컴퓨터 책방 그루잠 나래 도서 감사합니다 도서관 도서관 컴퓨터 우리는 별빛 도서관 도담도담 사과 아름드리 도서
                달볓 책방 산들림 바나나 미쁘다 책방. 아름드리 소솜 옅구름 소솜 바람꽃 도르레 아름드리 곰다시 소록소록 별하 예그리나 별빛 별빛 소솜 아련 아름드리
                여우별 사과 늘품 감사합니다 가온누리 아련 나비잠 사과 안녕 가온누리 바나나 노트북 비나리 컴퓨터 컴퓨터 감사합니다 소록소록 여우별 도서 아련
                아리아 로운 도서 나래 책방 이플 도르레 미쁘다 아름드리 컴퓨터 비나리 아슬라 아리아 바람꽃. 별빛 우리는 도서관 늘품 도서 나래 그루잠 곰다시 소솜
                달볓 안녕 가온누리 늘품 미리내 별빛 곰다시 아름드리 도서 그루잠 아리아 컴퓨터 늘품 책방 도르레 우리는 가온해 로운 가온해 비나리 노트북
                감사합니다 노트북 별하 노트북 늘품 달볓 별빛 컴퓨터 책방 로운 바나나 아슬라 가온누리 여우비 가온해 가온해 예그리나 여우비 가온누리 미쁘다.안녕
                바나나 비나리 이플 컴퓨터 책방 아련 그루잠 아슬라 가온해 소솜 여우별 아련 아리아 사과 사과 미리내 미리내 함초롱하다 도르레 도르레 소솜 포도
                도서관 도담도담 미리내 도담도담 나래 컴퓨터 책방 그루잠 나래 도서 감사합니다 도서관 도서관 컴퓨터 우리는 별빛 도서관 도담도담 사과 아름드리 도서
                달볓 책방 산들림 바나나 미쁘다 책방. 아름드리 소솜 옅구름 소솜 바람꽃 도르레 아름드리 곰다시 소록소록 별하 예그리나 별빛 별빛 소솜 아련 아름드리
                여우별 사과 늘품 감사합니다 가온누리 아련 나비잠 사과 안녕 가온누리 바나나 노트북 비나리 컴퓨터 컴퓨터 감사합니다 소록소록 여우별 도서 아련
                아리아 로운 도서 나래 책방 이플 도르레 미쁘다 아름드리 컴퓨터 비나리 아슬라 아리아 바람꽃. 별빛 우리는 도서관 늘품 도서 나래 그루잠 곰다시 소솜
                달볓 안녕 가온누리 늘품 미리내 별빛 곰다시 아름드리 도서 그루잠 아리아 컴퓨터 늘품 책방 도르레 우리는 가온해 로운 가온해 비나리 노트북
                감사합니다 노트북 별하 노트북 늘품 달볓 별빛 컴퓨터 책방 로운 바나나 아슬라 가온누리 여우비 가온해 가온해 예그리나 여우비 가온누리 미쁘다. 안녕
                바나나 비나리 이플 컴퓨터 책방 아련 그루잠 아슬라 가온해 소솜 여우별 아련 아리아 사과 사과 미리내 미리내 함초롱하다 도르레 도르레 소솜 포도
                도서관 도담도담 미리내 도담도담 나래 컴퓨터 책방 그루잠 나래 도서 감사합니다 도서관 도서관 컴퓨터 우리는 별빛 도서관 도담도담 사과 아름드리 도서
                달볓 책방 산들림 바나나 미쁘다 책방. 아름드리 소솜 옅구름 소솜 바람꽃 도르레 아름드리 곰다시 소록소록 별하 예그리나 별빛 별빛 소솜 아련 아름드리
                여우별 사과 늘품 감사합니다 가온누리 아련 나비잠 사과 안녕 가온누리 바나나 노트북 비나리 컴퓨터 컴퓨터 감사합니다 소록소록 여우별 도서 아련
                아리아 로운 도서 나래 책방 이플 도르레 미쁘다 아름드리 컴퓨터 비나리 아슬라 아리아 바람꽃. 별빛 우리는 도서관 늘품 도서 나래 그루잠 곰다시 소솜
                달볓 안녕 가온누리 늘품 미리내 별빛 곰다시 아름드리 도서 그루잠 아리아 컴퓨터 늘품 책방 도르레 우리는 가온해 로운 가온해 비나리 노트북
                감사합니다 노트북 별하 노트북 늘품 달볓 별빛 컴퓨터 책방 로운 바나나 아슬라 가온누리 여우비 가온해 가온해 예그리나 여우비 가온누리 미쁘다.안녕
                바나나 비나리 이플 컴퓨터 책방 아련 그루잠 아슬라 가온해 소솜 여우별 아련 아리아 사과 사과 미리내 미리내 함초롱하다 도르레 도르레 소솜 포도
                도서관 도담도담 미리내 도담도담 나래 컴퓨터 책방 그루잠 나래 도서 감사합니다 도서관 도서관 컴퓨터 우리는 별빛 도서관 도담도담 사과 아름드리 도서
                달볓 책방 산들림 바나나 미쁘다 책방. 아름드리 소솜 옅구름 소솜 바람꽃 도르레 아름드리 곰다시 소록소록 별하 예그리나 별빛
              </p>
            </div>
          </div>
        </div>
        <button type="button" className="closeButton" onClick={showModalHandler}>
          <img src="../static/images/ico/ico_close_01.png" alt="close button" />
        </button>
      </div>
      <span className="dim" onClick={showModalHandler}></span>
    </div>
  )
}

export default TermsModal
